{
  "attributes": {
    "color": {
      "name": "Color",
      "description": ""
    },
    "colors": {
      "name": "Colors",
      "description": ""
    },
    "rotation_aware": {
      "name": "Rotation aware",
      "description": ""
    }
  },

  "drafts": {
    "animation": {
      "additive": {
        "name": "Additive",
        "description": "Whether the animation frames will be drawn using additive blending."
      },
      "light": {
        "name": "Light",
        "description": "If set to true the game's shading (ie for night) will not be applied to the animation."
      },
      "light_switching": {
        "name": "Light switching",
        "description": "If set to true the animation will only be shown during night with some probabilistic switching behavior dependent on the using object."
      },
      "night_light_probability": {
        "name": "Night light probability",
        "description": "The probability of the light to turn on during night. 1 means it will always switch on. Smaller values mean that location and spot seed will be used to determine whether to switch it on."
      },
      "speed": {
        "name": "Speed multiplier",
        "description": "Animation speed multiplier."
      },
      "rotation_aware": {
        "name": "Rotation aware",
        "description": "If set to true the animation is considered to be animation aware. This means that the frames are assigned into groups. The group to draw will depend on the rotation of the underlying building. Ie if 8 frames were defined frames 0,1 will be used for the first rotation and so on."
      },
      "loop": {
        "name": "Loop",
        "description": ""
      },
      "handle_interpolation": {
        "name": "Handle interpolation",
        "description": ""
      },
      "ping_pong": {
        "name": "Ping pong",
        "description": ""
      }
    }
  },


  "objects": {
    "animation": {
      "id": {
        "name": "ID",
        "description": "ID of the animation draft."
      },
      "x": {
        "name": "X",
        "description": "The pixel location in x direction (to the right) relative to the call-site's origin."
      },
      "y": {
        "name": "Y",
        "description": "The pixel location in y direction (downwards) relative to the call-site's origin."
      },
      "shift": {
        "name": "Shift",
        "description": "Shifts the rendered frame. E.g. if frame 2 is to be rendered but shift is set to 1 then frame 3 will be rendered instead."
      },
      "frame_shift": {
        "name": "Frame shift",
        "description": ""
      },
      "on_fire": {
        "name": "Draw on fire",
        "description": "Whether the animation will be drawn if there is currently a fire in the city."
      },
      "on_crime": {
        "name": "Draw on crime",
        "description": "Whether the animation will be drawn if there is currently a crime in the city."
      },
      "is_burning": {
        "name": "Draw while burning",
        "description": "Whether the animation will be drawn if the owning building is currently on fire."
      },
      "in_winter": {
        "name": "Draw in winter",
        "description": "Whether the animation will be drawn during winter."
      },
      "in_summer": {
        "name": "Draw in summer",
        "description": "Whether the animation will be drawn during summer."
      },
      "seed": {
        "name": "Seed",
        "description": "Random seed value for random dependent stuff like light switching. Can be set manually to let multiple spots behave in the same way."
      },
      "color": {
        "name": "Color",
        "description": "A tint color for this animation spot. This will be applied besides other tint colors like daytime shading and animation color."
      },
      "frames": {
        "name": "Target frames",
        "description": "The frames for which this animation should be drawn. The default empty value means to always draw it."
      },
      "night_light_probability": {
        "name": "Night light probability",
        "description": "Like night light probability in animation draft but on the spot level. Both values will be multiplied before evaluation."
      },
      "rotation_aware": {
        "name": "Rotation aware",
        "description": "Only relevant for frame targeting. If true, the rotation frame of the underlying building will be used for target frames test instead of the actual frame to draw."
      }
    }
  }
}
